#애완동물을 소개해 주세요~

animoal = "강아지"
name = "퐁퐁이"
age = 4
hobby = "산책"
is_adult = age >= 3

print("우리집 "+animoal+"는 "+name+"예요")
hobby="공놀이"
#print(name + "는 " + str(age) + "살이며, " + hobby + "을 아주 좋아해요")
print(name, "는 " , str(age), "살이며, " ,hobby, "을 아주 좋아해요")
print(name + "는 어른일까요?" +str(is_adult))

#+는 띄어쓰기 안되지만 ,는 띄어쓰기가 강제됨 (+ = , 변행사용가능)
#주석(#)이란 프로그램에는 포함이 되어있지만 실제는 포함이 안되는것~

# '''이렇게
# 해도
# 여러문장이
# 주석처리
# 됩니다.
# 혹은 여러문장을 드래그 한뒤에 컨트롤하고 슬러쉬~~'''


# '''Quiz) 변수를 이용하여 다음 문장을 출력하시오

# 변수명
# :station

# 변수값
# : "사당", "신도림", "인천공항" 순서대로 입력

# 출력 문장
# :xx행 열차가 들어오고 있습니다.'''

station = "사당"

print(station+"행 열차가 들어오고 있습니다.")
print(1+1)

print()
